In [1]:
import numpy as np
import pandas as pd

In [3]:
data = {"Name":["Ali","Sara","John","Meera"], "Age":[25,28,23,30], "Salary":[50000,60000,55000,70000]}
df = pd.DataFrame(data)
df

    Name  Age  Salary
0    Ali   25   50000
1   Sara   28   60000
2   John   23   55000
3  Meera   30   70000

Select the "Name" column from this DataFrame:

In [4]:
df["Name"]

0      Ali
1     Sara
2     John
3    Meera
Name: Name, dtype: object

Select the first 3 rows using both slicing and iloc[].

In [5]:
df[:3]

   Name  Age  Salary
0   Ali   25   50000
1  Sara   28   60000
2  John   23   55000

In [6]:
df.iloc[0:3]

   Name  Age  Salary
0   Ali   25   50000
1  Sara   28   60000
2  John   23   55000

Filter all rows where "Age" is greater than 25.

In [8]:
df[df["Age"] > 25]

    Name  Age  Salary
1   Sara   28   60000
3  Meera   30   70000

Select rows 1–3 and columns "Name" and "Salary" using iloc[].

In [13]:
df.iloc[0:3, [0,2]]

   Name  Salary
0   Ali   50000
1  Sara   60000
2  John   55000

Filter rows where "Salary" is between 55,000 and 70,000.

In [17]:
df[(df["Salary"] > 55000) & (df["Salary"] < 70000)]

   Name  Age  Salary
1  Sara   28   60000

Select rows where "Age" is less than 30 and "Salary" is greater than 55,000.

In [18]:
df[(df["Age"] < 30) & (df["Salary"] > 55000)]

   Name  Age  Salary
1  Sara   28   60000

In [19]:


np.random.seed(0)

data = {
    "EmpID": range(101, 121),
    "Name": [f"Emp{i}" for i in range(1, 21)],
    "Dept": np.random.choice(["HR","IT","Finance","Sales"], 20),
    "Age": np.random.randint(22, 45, 20),
    "Salary": np.random.randint(40000, 90000, 20),
    "JoiningYear": np.random.randint(2015, 2023, 20),
    "Experience": np.random.randint(1, 10, 20),
    "Bonus": np.random.randint(1000, 5000, 20),
    "Manager": [f"Mgr{i}" for i in np.random.randint(1,6,20)],
    "Location": np.random.choice(["Delhi","Mumbai","Chennai","Bangalore"], 20)
}

df = pd.DataFrame(data)
print(df)

    EmpID   Name     Dept  Age  Salary  JoiningYear  Experience  Bonus  \
0     101   Emp1       HR   28   40797         2019           1   3217
1     102   Emp2    Sales   29   89811         2016           4   2699
2     103   Emp3       IT   36   43219         2022           6   2472
3     104   Emp4       HR   39   55246         2019           5   4167
4     105   Emp5    Sales   27   64999         2016           5   4269
5     106   Emp6    Sales   35   56321         2017           7   4678
6     107   Emp7    Sales   30   59129         2017           5   1256
7     108   Emp8    Sales   31   81504         2022           5   2905
8     109   Emp9       IT   42   89866         2015           4   4762
9     110  Emp10    Sales   41   58676         2016           5   2316
10    111  Emp11       IT   38   71230         2016           5   2954
11    112  Emp12  Finance   41   51723         2022           9   1816
12    113  Emp13       HR   27   83890         2016           5   4933
13    114  Emp14    Sales   37   57591         2016           4   3435
14    115  Emp15  Finance   37   83136         2018           8   2634
15    116  Emp16       HR   22   66752         2021           6   4626
16    117  Emp17       HR   40   63605         2022           6   1973
17    118  Emp18       HR   25   46021         2018           1   1368
18    119  Emp19  Finance   39   60006         2021           2   3023
19    120  Emp20       IT   41   43560         2017           6   3965

   Manager   Location
0     Mgr2    Chennai
1     Mgr1     Mumbai
2     Mgr3      Delhi
3     Mgr3    Chennai
4     Mgr4    Chennai
5     Mgr3  Bangalore
6     Mgr4      Delhi
7     Mgr3  Bangalore
8     Mgr2    Chennai
9     Mgr3  Bangalore
10    Mgr4      Delhi
11    Mgr4      Delhi
12    Mgr4    Chennai
13    Mgr3      Delhi
14    Mgr4    Chennai
15    Mgr5  Bangalore
16    Mgr2    Chennai
17    Mgr3    Chennai
18    Mgr4  Bangalore
19    Mgr2      Delhi

In [20]:
df.head()

,EmpID,Name,Dept,Age,Salary,JoiningYear,Experience,Bonus,Manager,Location
0,101,Emp1,HR,28,40797,2019,1,3217,Mgr2,Chennai
1,102,Emp2,Sales,29,89811,2016,4,2699,Mgr1,Mumbai
2,103,Emp3,IT,36,43219,2022,6,2472,Mgr3,Delhi
3,104,Emp4,HR,39,55246,2019,5,4167,Mgr3,Chennai
4,105,Emp5,Sales,27,64999,2016,5,4269,Mgr4,Chennai

Suppose the DataFrame has 10 columns and 20 rows, and you want to select rows 5–10 and columns "Dept", "Salary", "Age". You don’t know the index of the columns. How would you do it?

In [22]:
df.loc[5:10, ["Dept", "Salary", "Age"]]

     Dept  Salary  Age
5   Sales   56321   35
6   Sales   59129   30
7   Sales   81504   31
8      IT   89866   42
9   Sales   58676   41
10     IT   71230   38

Using boolean indexing, select all rows where the "Name" starts with "S" or "M".

In [24]:

data = {
    "Name": ["Sara", "Ali", "Meera", "John", "Sam", "Mohan"],
    "Age": [28, 25, 30, 23, 26, 29],
    "Salary": [60000, 50000, 70000, 55000, 58000, 62000]
}

df = pd.DataFrame(data)
df

    Name  Age  Salary
0   Sara   28   60000
1    Ali   25   50000
2  Meera   30   70000
3   John   23   55000
4    Sam   26   58000
5  Mohan   29   62000

In [30]:
df[df["Name"].str.startswith(("S","M"))]

    Name  Age  Salary
0   Sara   28   60000
2  Meera   30   70000
4    Sam   26   58000
5  Mohan   29   62000